Revit 2027 API
MaterialNode.HasOverriddenAppearance Property
 Identifies if the default rendering appearance the material has is being overridden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasOverriddenAppearance { get; }
Public ReadOnly Property HasOverriddenAppearance As Boolean
	Get
public:
property bool HasOverriddenAppearance {
	bool get ();
}
member HasOverriddenAppearance : bool with get
Property Value
Boolean
See Also
Reference
MaterialNode Class
Autodesk.Revit.DB Namespace